<template>
  <div id="table-container">
    <section id="table-top">
      <h1>{{ selectData.region + ' ' + selectData.category }}</h1>
      <section id="table-top-etc">
        <div>
          <button class="btn-home" @click="toggleDisplay">Home</button>
        </div>
        <div>
          <sapn style="margin-right: 10px">결제 가능 매장</sapn>
          <sapn id="table-total-count">검색결과 {{ 57 }}개</sapn>
          <!-- <button @click="toggleDisplay">Home</button> -->
        </div>
      </section>
    </section>
    <DataGrid
      style="height: 80%; width: 800px; margin: 0 auto"
      :pagination="true"
      :data="data"
      :total="total"
      :pageSize="pageSize"
      :pagePosition="pagePosition"
      :filterable="true"
      @pageChange="onPageChange"
    >
      <!-- 저장하면 다시 사라짐 ㅜㅜ -->
      <!-- <GridColumn
        v-for="field in fields"
        :field="field"
        :title="field"
        :key="field"
        halign="center"
      ></GridColumn> -->
      <GridColumn
        field="NO"
        title="NO"
        width="60px"
        halign="center"
        align="center"
      ></GridColumn>
      <GridColumn
        field="시군명"
        title="시군명"
        width="70px"
        halign="center"
        align="center"
      ></GridColumn>
      <GridColumn
        field="업종명(종목명)"
        title="업종명(종목명)"
        width="200px"
        halign="center"
      ></GridColumn>
      <GridColumn
        field="상호명"
        title="상호명"
        halign="center"
        width="200px"
      ></GridColumn>
      <GridColumn
        field="소재지도로명주소"
        title="소재지도로명주소"
        halign="center"
      ></GridColumn>
    </DataGrid>
  </div>
</template>

<script>
export default {
  props: ['selectData', 'onPageChange', 'toggleDisplay', 'data'],
  methods: {
    name() {},
  },

  data() {
    return {
      total: 0,
      // data: [],
      pageSize: 20,
      pagePosition: 'bottom',
      // data: this.$props.data,
      // data: [
      //   {
      //     시군명: '의정부시',
      //     상호명: '(KFME)컨벤션 펜션',
      //     NO: 100000,
      //     소재지지번주소: '경기도 가평군 조종면 마일리 300-6번지',
      //     경도: 127.3828364,
      //     '@timestamp': '2021-02-05T09:00:00.000+09:00',
      //     소재지도로명주소: '경기 가평군 조종면 연인산로474번길 47-66',
      //     '업종명(종목명)': '숙박업-여관/기타숙박업',
      //     위도: 37.84691866,
      //     우편번호: 12433,
      //     데이터기준일자: '2021-02-05',
      //   },
      //   {
      //     시군명: '가평군',
      //     상호명: '(북면)짜짜루',
      //     NO: 3,
      //     소재지지번주소: '경기도 가평군 북면 소법리 102-3번지',
      //     경도: 127.5606373,
      //     '@timestamp': '2021-02-05T09:00:00.000+09:00',
      //     소재지도로명주소: '경기 가평군 북면 화악산로 203',
      //     '업종명(종목명)': '일반휴게음식-일반한식',
      //     위도: 37.90011155,
      //     우편번호: 12404,
      //     데이터기준일자: '2021-02-05',
      //   },
      //   {
      //     시군명: '가평군',
      //     상호명: '(북면)한식전문점',
      //     NO: 4,
      //     소재지지번주소: '경기도 가평군 북면 목동리840-1',
      //     경도: 127.5493669,
      //     '@timestamp': '2021-02-05T09:00:00.000+09:00',
      //     소재지도로명주소: '경기 가평군 북면목동리840-1',
      //     '업종명(종목명)': '일반휴게음식-일반한식',
      //     위도: 37.8856869,
      //     우편번호: 12403,
      //     데이터기준일자: '2021-02-05',
      //   },
      //   {
      //     시군명: '가평군',
      //     상호명: '(북면)한식전문점',
      //     NO: 4,
      //     소재지지번주소: '경기도 가평군 북면 목동리840-1',
      //     경도: 127.5493669,
      //     '@timestamp': '2021-02-05T09:00:00.000+09:00',
      //     소재지도로명주소: '경기 가평군 북면목동리840-1',
      //     '업종명(종목명)': '일반휴게음식-일반한식',
      //     위도: 37.8856869,
      //     우편번호: 12403,
      //     데이터기준일자: '2021-02-05',
      //   },
      //   {
      //     시군명: '가평군',
      //     상호명: '(북면)한식전문점',
      //     NO: 4,
      //     소재지지번주소: '경기도 가평군 북면 목동리840-1',
      //     경도: 127.5493669,
      //     '@timestamp': '2021-02-05T09:00:00.000+09:00',
      //     소재지도로명주소: '경기 가평군 북면목동리840-1',
      //     '업종명(종목명)': '일반휴게음식-일반한식',
      //     위도: 37.8856869,
      //     우편번호: 12403,
      //     데이터기준일자: '2021-02-05',
      //   },
      //   {
      //     시군명: '가평군',
      //     상호명: '(북면)한식전문점',
      //     NO: 4,
      //     소재지지번주소: '경기도 가평군 북면 목동리840-1',
      //     경도: 127.5493669,
      //     '@timestamp': '2021-02-05T09:00:00.000+09:00',
      //     소재지도로명주소: '경기 가평군 북면목동리840-1',
      //     '업종명(종목명)': '일반휴게음식-일반한식',
      //     위도: 37.8856869,
      //     우편번호: 12403,
      //     데이터기준일자: '2021-02-05',
      //   },
      //   {
      //     시군명: '가평군',
      //     상호명: '(북면)한식전문점',
      //     NO: 4,
      //     소재지지번주소: '경기도 가평군 북면 목동리840-1',
      //     경도: 127.5493669,
      //     '@timestamp': '2021-02-05T09:00:00.000+09:00',
      //     소재지도로명주소: '경기 가평군 북면목동리840-1',
      //     '업종명(종목명)': '일반휴게음식-일반한식',
      //     위도: 37.8856869,
      //     우편번호: 12403,
      //     데이터기준일자: '2021-02-05',
      //   },
      //   {
      //     시군명: '가평군',
      //     상호명: '(북면)한식전문점',
      //     NO: 4,
      //     소재지지번주소: '경기도 가평군 북면 목동리840-1',
      //     경도: 127.5493669,
      //     '@timestamp': '2021-02-05T09:00:00.000+09:00',
      //     소재지도로명주소: '경기 가평군 북면목동리840-1',
      //     '업종명(종목명)': '일반휴게음식-일반한식',
      //     위도: 37.8856869,
      //     우편번호: 12403,
      //     데이터기준일자: '2021-02-05',
      //   },
      //   {
      //     시군명: '가평군',
      //     상호명: '(북면)한식전문점',
      //     NO: 4,
      //     소재지지번주소: '경기도 가평군 북면 목동리840-1',
      //     경도: 127.5493669,
      //     '@timestamp': '2021-02-05T09:00:00.000+09:00',
      //     소재지도로명주소: '경기 가평군 북면목동리840-1',
      //     '업종명(종목명)': '일반휴게음식-일반한식',
      //     위도: 37.8856869,
      //     우편번호: 12403,
      //     데이터기준일자: '2021-02-05',
      //   },
      //   {
      //     시군명: '가평군',
      //     상호명: '(북면)한식전문점',
      //     NO: 4,
      //     소재지지번주소: '경기도 가평군 북면 목동리840-1',
      //     경도: 127.5493669,
      //     '@timestamp': '2021-02-05T09:00:00.000+09:00',
      //     소재지도로명주소: '경기 가평군 북면목동리840-1',
      //     '업종명(종목명)': '일반휴게음식-일반한식',
      //     위도: 37.8856869,
      //     우편번호: 12403,
      //     데이터기준일자: '2021-02-05',
      //   },
      //   {
      //     시군명: '가평군',
      //     상호명: '(북면)한식전문점',
      //     NO: 4,
      //     소재지지번주소: '경기도 가평군 북면 목동리840-1',
      //     경도: 127.5493669,
      //     '@timestamp': '2021-02-05T09:00:00.000+09:00',
      //     소재지도로명주소: '경기 가평군 북면목동리840-1',
      //     '업종명(종목명)': '일반휴게음식-일반한식',
      //     위도: 37.8856869,
      //     우편번호: 12403,
      //     데이터기준일자: '2021-02-05',
      //   },
      //   {
      //     시군명: '가평군',
      //     상호명: '(북면)한식전문점',
      //     NO: 4,
      //     소재지지번주소: '경기도 가평군 북면 목동리840-1',
      //     경도: 127.5493669,
      //     '@timestamp': '2021-02-05T09:00:00.000+09:00',
      //     소재지도로명주소: '경기 가평군 북면목동리840-1',
      //     '업종명(종목명)': '일반휴게음식-일반한식',
      //     위도: 37.8856869,
      //     우편번호: 12403,
      //     데이터기준일자: '2021-02-05',
      //   },
      //   {
      //     시군명: '가평군',
      //     상호명: '(북면)한식전문점',
      //     NO: 4,
      //     소재지지번주소: '경기도 가평군 북면 목동리840-1',
      //     경도: 127.5493669,
      //     '@timestamp': '2021-02-05T09:00:00.000+09:00',
      //     소재지도로명주소: '경기 가평군 북면목동리840-1',
      //     '업종명(종목명)': '일반휴게음식-일반한식',
      //     위도: 37.8856869,
      //     우편번호: 12403,
      //     데이터기준일자: '2021-02-05',
      //   },
      //   {
      //     시군명: '가평군',
      //     상호명: '(북면)한식전문점',
      //     NO: 4,
      //     소재지지번주소: '경기도 가평군 북면 목동리840-1',
      //     경도: 127.5493669,
      //     '@timestamp': '2021-02-05T09:00:00.000+09:00',
      //     소재지도로명주소: '경기 가평군 북면목동리840-1',
      //     '업종명(종목명)': '일반휴게음식-일반한식',
      //     위도: 37.8856869,
      //     우편번호: 12403,
      //     데이터기준일자: '2021-02-05',
      //   },
      //   {
      //     시군명: '가평군',
      //     상호명: '(북면)한식전문점',
      //     NO: 4,
      //     소재지지번주소: '경기도 가평군 북면 목동리840-1',
      //     경도: 127.5493669,
      //     '@timestamp': '2021-02-05T09:00:00.000+09:00',
      //     소재지도로명주소: '경기 가평군 북면목동리840-1',
      //     '업종명(종목명)': '일반휴게음식-일반한식',
      //     위도: 37.8856869,
      //     우편번호: 12403,
      //     데이터기준일자: '2021-02-05',
      //   },
      // ],
      fields: ['NO', '시군명', '업종명(종목명)', '상호명', '소재지도로명주소'],
      widths: ['100px', '100px', '100px', '100px', '100px'],
    };
  },
  methods: {},
};
</script>

<style>
#table-container {
  /* padding: 50px; */
  /* text-align: left; */
  width: 800px;
  margin: 0 auto;
}

#table-top {
  /* color: red; */
  /* width: 800px; */
  /* padding-left: 50px; */
  /* text-align: center; */
  margin-bottom: 5px;
}

#table-total-count {
  border-left: 1px gray solid;
  padding-left: 10px;
}

#table-top-etc {
  display: 'flex';
  flex-direction: 'row';
  justify-content: 'space-between';
}
#table-top-etc div:first-child {
  /* color: red; */
  text-align: right;
  /* display: inline-block; */
}

/* table  customizing */
.panel-header,
.panel-body {
  /* border-width: 1px; */
  border-style: none;
}
</style>
